Terraform plan in __.__
```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_route_table.selected will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route_table" "selected"  {
      + associations   = (known after apply)
      + gateway_id     = (known after apply)
      + id             = (known after apply)
      + owner_id       = (known after apply)
      + route_table_id = (known after apply)
      + routes         = (known after apply)
      + subnet_id      = (known after apply)
      + tags           = (known after apply)
      + vpc_id         = (known after apply)
    }

  # aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = 10
      + desired_capacity          = 3
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 6
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "asg"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "main"
        }
      + vpc_id   = (known after apply)
    }

  # aws_launch_template.launch-template will be created
  + resource "aws_launch_template" "launch-template" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "*********************"
      + instance_type          = "t2.micro"
      + latest_version         = (known after apply)
      + name                   = "launch-template"
      + update_default_version = true
      + user_data              = "IyEvYmluL2Jhc2gKeXVtIHVwZGF0ZSAteQp5dW0gaW5zdGFsbCAteSBnY2MgZ2NjLWMrKyBweXRob24zIHB5dGhvbjMtZGV2ZWwgZ2l0CiMgUnVuIGh0dHBiaW4gYXMgdGhlIGVjMi11c2VyIGZvciBzZWN1cml0eQpzdSBlYzItdXNlciAtYyBcCiAgJ2V4cG9ydCBQQVRIPSR7UEFUSH06L2hvbWUvZWMyLXVzZXIvLmxvY2FsL2JpbgogIGNkIC9ob21lL2VjMi11c2VyCiAgZ2l0IGNsb25lIGh0dHBzOi8vZ2l0aHViLmNvbS9wb3N0bWFubGFicy9odHRwYmluLmdpdAogIGNkIGh0dHBiaW4KICBzZWQgInMlUmVzcG9uc2UgU2VydmljZS4lUmVzcG9uc2UgU2VydmljZS48YnIvPlJ1bm5pbmcgb24gJChob3N0bmFtZSAtZiklIiAtaSBodHRwYmluL2NvcmUucHkKICBwaXAzIGluc3RhbGwgLS11c2VyIC0tbm8tY2FjaGUtZGlyIHBpcGVudgogIHBpcDMgaW5zdGFsbCAtLXVzZXIgLS1uby1jYWNoZS1kaXIgLXIgPChwaXBlbnYgbG9jayAtcikKICBwaXAzIGluc3RhbGwgLS11c2VyIC0tbm8tY2FjaGUtZGlyIC4KICBndW5pY29ybiAtYiAwLjAuMC4wOjgwODAgaHR0cGJpbjphcHAgLWsgZ2V2ZW50Jwo="

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = (known after apply)
        }
    }

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "alb"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.front-end will be created
  + resource "aws_lb_listener" "front-end" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.target-group will be created
  + resource "aws_lb_target_group" "target-group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "tg-"
      + port                               = 8080
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_route.igw-route will be created
  + resource "aws_route" "igw-route" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # aws_security_group.alb-sg will be created
  + resource "aws_security_group" "alb-sg" {
      + arn                    = (known after apply)
      + description            = "Allow traffic from the VPC to the ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from VPC"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "alb-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.backend-sg will be created
  + resource "aws_security_group" "backend-sg" {
      + arn                    = (known after apply)
      + description            = "Allow traffic from the ALB to the backend EC2s"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "HTTP from ALB"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "backend-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "backend-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.public-subnets["eu-west-3a"] will be created
  + resource "aws_subnet" "public-subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-3a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.32.0.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-eu-west-3a"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.public-subnets["eu-west-3b"] will be created
  + resource "aws_subnet" "public-subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-3b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.32.32.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-eu-west-3b"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.public-subnets["eu-west-3c"] will be created
  + resource "aws_subnet" "public-subnets" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-3c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "172.32.64.0/19"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-eu-west-3c"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "172.32.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "main"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb-dns = (known after apply)
```
Plan generated in [Terraform #3](https://github.com/guillaumelecerf/scalable-httpbin-aws-infra/actions/runs/564060760)